a =  str(input("Введите первый цвет:"))
b =  str(input("Введите второй цвет:"))
if (a != "Красный") and (a != "Синий") and(a != "Желтый"):
    print("Ошибка")
elif (b != "Красный") and (b != "Синий") and (b != "Желтый"):
    print("Error")
elif (a == "Красный") and (b == "Синий"):
    print("Фиолетовый")
elif (a == "Красный") and (b == "Желтый"):
    print("Оранжевый")
elif (a == "Синий") and (b == "Желтый"):
    print("Зеленый")
elif (b == "Красный") and (a == "Синий"):
    print("Фиолетовый")
elif (b == "Красный") and (a == "Желтый"):
    print("Оранжевый")
elif (b == "Синий") and (a == "Желтый"):
    print("Зеленый")



